[
  {
    "path": "posts/2022-05-30-big-data-practices/",
    "title": "Big Data Practices",
    "description": "Several Big Data projects carried out by National Statistic Office.",
    "author": [
      {
        "name": "Dewi Lestari Amaliah",
        "url": {}
      }
    ],
    "date": "2022-05-30",
    "categories": [],
    "contents": "\n\n\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2022-07-25T14:12:30+07:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-10-25-covidcolsa-review/",
    "title": "Get to Know covidcolsa",
    "description": "This article aims to introduce and review an R package called \"covidcolsa\".",
    "author": [
      {
        "name": "Dewi Lestari Amaliah",
        "url": {}
      }
    ],
    "date": "2020-10-25",
    "categories": [
      "COVID-19",
      "Shiny App",
      "R Package"
    ],
    "contents": "\n\n\nOne of the assessments in the Communicating with Data unit in Monash University’s Master of Business Analytics program is to create an R package. After fulfilling this assignment, each student has to conduct a peer review of another student’s package. In this opportunity, I would like to review a package called “covidcolsa”.\n\n📦   About the Package  \n\ncovidcolsa is an R package authored by Rahul Bharadwaj Mysore Venkatesh. This package’s goal is to provide an easy access to COVID-19 data and statistics in Colombia and South Africa (“colsa”) via an R Shiny App that comprises of the counts of tests, cases, recoveries, and deaths summarized and compared between the two regions (Venkatesh 2020). Additionally, this package contains three functions, which are launch_app(), country_select_input(), and dailyplot(). This package is also built with 3 embedded data sets, which are the daily COVID-19 data for Colombia (DailyCOL) and South Africa (DailyZAF) and the COVID-19 data for these two countries (covid_colsa).\n\n📦   The Review  \n\nNow is the time for reviewing.\n\n\n\nFigure 1: Source: giphy.com\n\n\n\nAs mentioned in the previous section, this package contains three functions. Since this package aims to explore the COVID-19 data and statistics through a Shiny App, then the launch_app() function would be the package’s primary function. As claimed, covidcolsa, through its launch_app() function, made the data of COVID-19 in Colombia and South Africa is easy to access. This function also could be run without any significant error. I just have to install the reactable package since I did not have it installed on my device. Other functions, dailyplot(), the function to plot the daily attributes of COVID-19, and country_select_input(), the function to make custom input selections in the Shiny app, also could be run without any error as long as it is fed with the correct input. The data sets also could be loaded as expected.\nEven so, there are some plausible improvements that I would suggest for the package that I listed as follows:\nIt might be a better practice to include the packages used in the Shiny app as the suggested packages in the Description file. With this information, the users will have a prior information of what packages should be installed before using the function in the package.\nFurther, I would suggest adding assertions in the launch_app() function by including the requireNamespace function to the code.\nRegarding the Shiny app, since the COVID-19 indicators are displayed comparison-wise, it would be better if the statistics used is the rate, e.g., the rate per a million people. The comparison based on the raw statistics (total counts) might be not apple to apple since those countries’ population is different.\nThe help file for all of the functions is accessible and it allows me to get a brief overview of what the functions would do. However, there is no example on how to use the code. Hence, I would suggest to add example of functions usage in the documentation.\nVignette is intended to show the user the problem that the package is designed to solve and how to solve it (Wickham and Bryan 2019). However, this package’s vignette only shows the usage of the contained data set; in this case, it is “covid_colsa” data set. Hence, I suggest that a section of “tutorial” on using the function could be added to the vignette. It would be a kind of “relief” since the help files did not have the function usage example.\nFinally, by reviewing this package, I learned that documentation is a communication tool between the package developer and the users. I would say that it is as much as essential as the functions itself. Without proper documentation, the user will hardly use the functions in the package.\n\n📦   Appendix  \n\nReview Checklist\nThis checklist is adapted from ropensci review template. The aim of this checklist is to provide the compliteness of documentation and functionality of the package.\n\nDocumentation\nThe package includes all the following forms of documentation:\n✅ Installation instructions for the package is found in README.\n❌ Vignette(s) demonstrating major functionality that runs successfully locally.\n✅ Function Documentation for all exported functions in R help.\n❌ Examples for all exported functions in R help that run successfully locally.\nNote: The vignette only demonstrated the usage of one of the data sets contained. It is contained in the package’s website, but I cannot find it locally.\n\nFunctionality\n✅ Installation: Installation succeeds as documented.\n✅ Functionality: any functional claim of the software been confirmed.\n✅ Automated tests: Unit tests cover essential functions of the package and a reasonable range of inputs and conditions. All tests pass on the local machine.\nAcknowledgments\nThe website and the blog post was created using R distill package by JJ Allaire, Rich Iannone, and Yihui Xie.\nThe emoji is write with R emo package by Hadley Wickham.\n\n\nVenkatesh, Rahul Bharadwaj Mysore. 2020. “Covidcolsa.” https://etc5523-2020.github.io/r-package-assessment-rahul-bharadwaj/index.html.\n\n\nWickham, Hadley, and Jennifer Bryan. 2019. R Packages: Organize, Test, Document, and Share Your Code. O’Reilly. https://r-pkgs.org/index.html.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2020-10-29T05:12:09+07:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-10-14-shinyselfreview/",
    "title": "COVID19-EUxplorer",
    "description": "A self-reflection of my first Shiny app, COVID19-EUxplorer.",
    "author": [
      {
        "name": "Dewi Lestari Amaliah",
        "url": {}
      }
    ],
    "date": "2020-10-14",
    "categories": [
      "COVID-19",
      "Shiny App"
    ],
    "contents": "\n\n\nThe sky is only the limit. It might sound hyperbolic, but this is what I would say when talking about R and all of its packages. In other words, I would say that you basically can make anything straight from R, from a report, a gif image, a presentation slides, a letter, even a website, not to mention the statistical analysis, from the basic to the sophisticated one.\nIn this article, I would like to discuss an interactive web app that I made with one of its packages, Shiny developed by Winston Chang, Joe Cheng, JJ Allaire, Yihui Xie, and Jonathan McPherson Chang et al. (2020). The discussion would be about the app itself and a self-review about the app. I developed this app as part of ETC5523 Communicating with Data assignment, one of the core units in the Master of Business Analytics program, Monash University.\n\n\n\nFigure 1: The landing page of the app\n\n\n\n\n  About the app  \n\nI named the app COVID19-EUxplorer: a COVID-19 in Europe Data Explorer. The reason I made a data explorer app is because data is essential in the fight against COVID-19. It helps governments and health sector authorities to measure policy. It can even help us, as part of the community, understand the current situation, and how we can play a role, hand in hand, to prevent the wider transmission. Hence, the aim of this app is a tool to explore the data of COVID-19 related variables in various countries in Europe.\nFurther, there are two reasons I chose Europe as the region to explore:\nSome countries in Europe have experienced an increase in positive cases after previously having decreased cases (Costagliola, Lopez-Goni, and Panovska-Griffiths 2020). Hence, there is a possibility of an increasing severity of the pandemic in this region given the geographic conditions i.e. the country is close one to another. Moreover, some countries have lifted the lockdown restriction.\nThe data available for Europe includes many indicators, not only limited to confirmed cases and deaths. Hence it is suitable for use in a data exploration app.\n\n\n\nFigure 2: The overview of the app\n\n\n\nThis app comprises of seven tabs as follows:\n\n  Home tab  \n\nThe content of Home tab or the landing page as we can see in Figure 1 is a very brief overview of the app. It also urges the user to explore the app through the tabs.\n\n  Cases and Deaths tab  \n\nThis tab aims to visualize the cases and deaths of COVID-19 in 51 countries in Europe in daily and cumulative figure. Further, the users are allowed to choose the indicators they want to display: 1. Cases; 2. Cases per 10,000 population; 3. Deaths; and 4. Deaths per 10,000 population. The users also can compare between countries and choose the time range they want.\n See the tab here \n\n\n\nFigure 3: The display of Cases and Deaths tab\n\n\n\n\n\n  Testing tab  \n\nThis tab comprises of the visualization of testing and positivity rate of COVID-19 for country members of the European Union (EU)/European Economic Area (EEA) and the United Kingdom weekly. Just like the previous tab, the users are also allowed to choose multiple countries and week range. The plots also come with a benchmark line, i.e., the recommended testing and positivity rate for each corresponding chart.\n See the tab here \n\n\n\nFigure 4: The display of Testing tab\n\n\n\n\n\n  Tracing tab  \n\nThis tab aims to explore the tracing of COVID-19 for country members of the EU / EEA and the United Kingdom. The tracing indicator is approached with the dominant transmission in each country. In this tab, the users can only choose one country. However, they are still able to compare the dominant transmission from week to week. Apart from selecting a country via the dropdown button, users can also set a country by clicking the map’s bubble. The bubble size reflects the rate of COVID-19 cases per 10,000 people. Hence, in choosing the country for exploration, the users can use this map as a benchmark.\n See the tab here \n\n\n\nFigure 5: The display of Tracing tab\n\n\n\n\n\n  Community Mobility tab  \n\nThe objective of this tab is to explore the mobility of people during the pandemic in six types of locations daily. The users are allowed to choose a country to be displayed. The users also can choose the time range. I also added an interactive table of country response measure, which shows the start date and the end date of a measure. Since community mobility is developed to observe the effect of measure to the community activity, this table is useful as a benchmark of choosing the date to track that effect.\n See the tab here \n\n\n\nFigure 6: The display of Community Mobility tab\n\n\n\n\n\n  Data tab  \n\nThis tab displays the raw data that are used to visualize the variables in the previous tabs. The users are allowed to choose one or more countries, even select all of the countries available. They are also allowed to choose the time range.\n See the tab here \n\n\nFigure 7: The display of Data tab\n\n\n\n\n\n  More tab  \n\nThis tab has two sub-tabs: About and References. The About sub-tab specifies the purpose of the app and other relevant information, such as the data source used in the app and the R packages to make the app. I also wrote a brief information about my self as the creator of the app. The References sub-tab conveys the reference of data sources, readings, packages, and images used in the app.\n See the tab here \n\n\nFigure 8: The display of More tab\n\n\n\n\n\n  Self Review  \n\n\n\n\nFigure 9: Source: giphy.com\n\n\n\nSelf-evaluation is an essential mechanism in learning. For me, it is kind of a way to track my journey on learning something new. The future me could go back to this review and see how far I’ve progressed. Most importantly, I could use this self-critics to make a better app in the future.\n\n What I’ve done well \n\nOverall, I feel that I have done pretty well in following all the prompts given in the project’s instruction. Additionally, I also made some tweaks that I hope could improve the app’s functionality as a whole, including:\nSubstantially, this app covers various variables, not only cases and deaths, but also the testing and positivity rates, the dominant transmission, the people’s mobility, and even the government measure. I realized that many variables made it possible to make the app less focused. Hence, I separated these variables into several tabs. I hope that this division would make the app is compact and easy to use.\nTo achieve its goal as a data explorer, this app gives users a full flexibility in choosing the variables to display. This app also supports the flexibility of time-wise comparison in a specific country or some countries at once.\nAn additional instruction below each plot to enhance the information conveyed by the visualization. For example: “Hover to the line to see a detailed figure.”\n\n Area for improvement \n\nThat said, I realized that this app has still had some weaknesses. Some weaknesses related to the app’s display and functionality could be fixed by adding extra tweaking. The other improvement could not be done immediately due to the limitation of data or technology. Here I will list out which one of the app’s limitations falls to which category and future actions to improve the app.\n\n  Plausible improvement  \n\nI would improve the landing page by adding the clickable link to each tab below the box. Hence, the user could follow the tab right after reading the text in the box rather than scroll up the page again to find the top’s navigation bar.\nJust like the dashed lines in the testing and positivity rate plots, I wish I have also added a dashed line of the average cases and deaths rate per 10,000 population in Europe. This addition would add another insight to the users in making a comparison.\nI would add a custom color for each country in the plots in “Cases and Death” and the “Testing” tab. Thus, each country’s color is consistent even though any new country is added to the plot.\nIn the app, the x-axis label sequence in the daily-wise plots is still by three months. I should have changed it into monthly.\nFor the weekly based plots, I should have added a definition of when week 1 started. Although this information is available in the data table, I realized that the users might not be able to find it immediately.\nIn the Tracing and the Community Mobility tab, I feel like the information is all over the place. It would have been better if I used a fluidRow column to design a better layout. The layout might be adapting to this app. Unfortunately, I was getting used to using the fluidRow near the project’s due when everything has set up.\nTransmission chart is likely hard to read. However, I have give an explanation on how to read the plot.\nI wish I have changed the slider input to choose the date range into a date input in the Community Mobility tab. This change would allow the user to quickly select the date according to the measure without having to slide back and forth to find the exact date.\nLast but not least, I should have given a comma separation to the population column in the data tables. Hence, the population figure would be more readable.\n\n  Current implausible improvement and the future goals  \n\nThe goal of this app in the future is an automatically updated data in the weekly testing and positivity rate and the weekly dominant transmission variables. The current app needs manual data feeding since the file name of the data in the European Centre of Disease Control and Prevention (ECDC) website, the data source of these variables, is always changed every time they update the data. Thus, the URL read code in R would not work in this case.\nAnother feature that I want to add is a forecasting or simulation feature just like this app, developed by MGH Institute for Technology Assessment, Harvard Medical School MGH Institute for Technology Assessment (2020).\n\n\n\nFigure 10: COVID-19 simulator\n\n\n\nCurrently, this feature could not be added not because of the limitation of data and technology, but the limit of my knowledge. Hence, I think I should enhance my knowledge and skill regarding forecasting and simulation, or another feasible way is to collaborate with others.\n\n  Final Note  \n\nI learned a lot of valuable lessons in making this first app. Not only it builds up my skill technically in creating an app, but also, most importantly, I learned that in making an app, we must always put our perspective as the users. Hence, it will improve the user interface and the user experience along the way the app is built.\n\n\nChang, Winston, Joe Cheng, JJ Allaire, Yihui Xie, and Jonathan McPherson. 2020. Shiny: Web Application Framework for R. https://CRAN.R-project.org/package=shiny.\n\n\nCostagliola, Dominique, Ignacio Lopez-Goni, and Jasmina Panovska-Griffiths. 2020. “How Worried Should We Be About the Coronavirus Resurgence in Europe? Three Experts Weigh in.” https://theconversation.com/how-worried-should-we-be-about-the-coronavirus-resurgence-in-europe-three-experts-weigh-in-143858.\n\n\nMGH Institute for Technology Assessment. 2020. “COVID-19 Simulator.” https://analytics-tools.shinyapps.io/covid19simulator02/.\n\n\n\n\n",
    "preview": "posts/2020-10-14-shinyselfreview/shiny_gif/prev_image.png",
    "last_modified": "2020-10-15T10:24:46+07:00",
    "input_file": {},
    "preview_width": 1439,
    "preview_height": 837
  },
  {
    "path": "posts/2020-09-15-covid-in-conflict/",
    "title": "COVID and Conflict: Why the pandemic could be worse in Afghanistan?",
    "description": "This article aims to convey the reason why the conflicted country, in this case is Afghanistan, might be hit harder by COVID-19.",
    "author": [
      {
        "name": "Dewi Lestari Amaliah",
        "url": {}
      }
    ],
    "date": "2020-09-15",
    "categories": [
      "COVID-19",
      "Data Analysis"
    ],
    "contents": "\nTable of Contents\nIntroduction\nData Source\nCOVID-19 Cases in Afghanistan\nWhy it could be worse?\nConclusion\nAcknowledgments\n\n\nIntroduction\nSince being declared as a global pandemic by the World Health Organization (WHO) on 12 March 2020, COVID-19 has affected 213 countries, including the conflict-torn country, Afghanistan (worldometer 2020). This country has its first confirmed case recorded on 24 February 2020 in Herat Povince after a citizen who had just returned from Iran contracted with the virus (Wikipedia 2020a).\nViruses are indeed indiscriminate. Unfortunately, the presence of COVID-19 amid this war-shattered country seems to rub salt into the wound. According to the United Nations Office for the Coordination of Humanitarian Affairs (OCHA) data, as of 6 September 2020, there were already 151,190 people displaced by the conflict (United Nations Office for the Coordination of Humanitarian Affairs 2020). Further, in 2019, civilian casualties due to the conflict has surpassed 100,000 (United Nations Assistance Mission in Afghanistan 2020). The Secretary-General’s Special Representative for Afghanistan and head of the UN Assistance Mission in Afghanistan (UNAMA) said as follows:\n\n“Almost no civilian in Afghanistan has escaped being personally affected in some way by the ongoing violence” - Tadamichi Yamamoto (United Nations Assistance Mission in Afghanistan 2020)\n\nIn other words, the Afghan people are already vulnerable before COVID-19 attacks.\nThis article aims to convey the reasons why the conflict brings the pandemic getting worse in Afghanistan. The analysis would be focused on two aspects, namely health care and economic vulnerability.\nData Source\nIn doing analysis, I used several data sets from various sources. For the COVID-19 situation in Afghanistan, I used the data of confirmed cases and deaths from John Hopkins University Center for System Science and Engineering (JHU CSSE) (John Hopkins University CSSE 2020) and the population data from the World Bank (World Bank 2020). I also used the mobility data from Google COVID-19 Community Mobile Report (Google 2020) to analyze the population vulnerability. These data have been compiled in the tidycovid19 R package by Joachim Gassen (Gassen 2020), hence I directly downloaded it from this package. For the health care vulnerability analysis, I mainly used the data of health sector profile from the Afghanistan National Statistics and Information Authority (National Statistics & Information Authority of Afghanistan 2020) and the government national budget data from the Afghanistan Ministry of Finance (Islamic Republic of Afghanistan Ministry of Finance 2019).\n\n\n\n\n\n\n\n\n\n\n\n\nAnalysis Tools\nThe analysis is performed using R (R Core Team 2020). The data is wrangled mainly using the tidyverse function (Wickham et al. 2019). Further, the data is visualized using the function in ggplot2 (Wickham 2016), gghighlight (Yutani 2020) and ggrepel (Slowikowski 2020). I also used gt (Iannone, Cheng, and Schloerke 2020) and and scales (Wickham and Seidel 2020).\nCOVID-19 Cases in Afghanistan\nTo analyze the COVID-19 situation in Afghanistan, I used the cumulative numbers of confirmed cases and deaths. It is because I only want to see the general condition of COVID-19 in this country.\n\n\n\n\n\n\n\nFigure 1: COVID-19 confirmed cases and deaths in Afghanistan 24 February to 15 September 2020\n\n\n\n\n\n\n\nFigure 1 shows that until 15 September 2020, the number of COVID-19 cases in Afghanistan has reached 38,815, or equivalent to 1020.33 cases per one million population. We can also see that the curve flattened.\nRegarding the death case, as of 15 September 2020, the number is 1,426 with 3.67 percent of case fatality rate. However, we could not conclude anything from this indicator because the WHO said that the fatality rate varies in each country from 0.1% to more than 25%. The calculation method is also still rough (World Health Organization 2019).\nIf we only look at the confirmed case number, we might conclude that Afghanistan has handled this pandemic well, given the evidence that the curve started to flatten. However, how reliable is the data? Of course, we cannot see this indicator alone. We also have to take other indicators into account, namely the testing rate and the positive rate. Unfortunately, it is tough to find Afghanistan’s data for these indicators. Our World In Data, the source of testing data in tidycovid19 package also does not have this indicator data for Afghanistan.\nFurther, according to the WHO, the actual rate of transmission is mostly underestimated since the disease is sometimes asymptomatic (World Health Organization 2019). The low testing capacity in the country then exacerbated the situation. According to Nicholas Bishop, an expert of the United Nations International Organization for Migration (IOM), as per June 2020, Afghanistan only held 646 tests per million population, bringing it to be one of the countries with lowest testing in the world (Changoiwala 2020). He also added that the true cases of COVID-19 in Afghanistan could be millions since there is a significant level of community transmissions across 34 provinces. Similarly, a survey conducted by KabulNow concluded that the actual cases in Kabul could be ten times more than the official record (Haidar 2020).\nWhy it could be worse?\nAssuming that the actual cases are much higher than the official record, we could see an already bad situation in this war-torn country. Unfortunately, as I mentioned in the introduction, Afghan people are already miserable enough because of the conflict. Hence in this part, I would emphasize the conflict effects that made the pandemic worse in this country.\nHealth Care Vulnerability\nThe prolonged conflict in the past 18 years in Afghanistan has shifted the government focus to defense and safety affairs. Figure 2 suggests that more than 40 percent of the government’s budget plan in 2020 is for defense and public order and safety. The fund for public health only accounts for 4.4 percent, much lower than the other budget.\n\n\n\n\n\n\n\nFigure 2: Afghanistan’s plan of budget distribution in 2020\n\n\n\n\n Expand here if you want to see the detailed number of the budget \n\nAfghanistan Budget Outlook (in Afghan Afghani)\n    \n    Budget\n      2019\n      20201\n      20211\n      20221\n     General public service\n      43.20B\n      47.14B\n      51.01B\n      55.12B\n     Defense\n      101.39B\n      95.03B\n      96.60B\n      100.68B\n     Public order and safety\n      64.54B\n      66.72B\n      67.35B\n      65.95B\n     Economic affairs\n      94.80B\n      77.30B\n      79.72B\n      79.61B\n     Environmental protection\n      1.55B\n      1.76B\n      1.94B\n      2.09B\n     Housing and community amenities\n      11.20B\n      11.10B\n      11.96B\n      12.52B\n     Health\n      17.62B\n      16.46B\n      17.66B\n      18.68B\n     Recreation, culture and religion\n      3.61B\n      4.03B\n      4.49B\n      5.05B\n     Education\n      49.78B\n      54.84B\n      61.68B\n      70.85B\n    \n        \n          1\n          \n           \n          Budget plan\n          \n      \n    \n\n\n\nTable 1. Health Care Profile of Afghanistan 2017-2019\n    \n    Indicators\n      Unit\n      2017\n      2018\n      2019\n    Number of  doctors\n      Person\n      8744\n      8216.0\n      8082\n    Number of Health Associate Professional\n      Person\n      19743\n      21322.0\n      20988\n    Number of  beds in public hospitals\n      Bed\n      15122\n      14707.0\n      14511\n    Total Number of Hospitals\n      No.\n      531\n      536.0\n      641\n    Bed  per ten thousand person\n      Bed\n      5\n      5.0\n      5\n    Doctors per ten thousand person\n      person\n      3\n      2.4\n      3\n    Source: Afghanistan Statistical Year Book 2019, NSIA, page 131-132\n    \n\nFurther the health care facility in Afghanistan could be considered as inappropriate. In the three years of 2017 to 2019, there is no significant progress in health facilities provision in Afghanistan (refer to Table 1). The number of health associate professional even decreased in 2019. Further, the latest available data show that there are only three doctors for every 10,000 Afghans. Meanwhile, there are only five hospital beds per 10,000 population.\nThis reality is even more bitter because health facilities and their workers are often the targets of non-state armed groups. According to the UN Assistance Mission in Afghanistan report, 12 deliberate attacks on health care have happened during the pandemic (Devi 2020). One of them was carried out by armed men who attacked Dasht-e-Barchi hospital in Kabul on 12 May 2020. This attack killed 24 people, including 16 women and two babies. After this incident, Médecins Sans Frontières (MSF), a medical humanitarian organization, stopped its activities at this hospital, which means that one health facility was depleted, even though the need is increasing due to the pandemic.\nEconomic Vulnerability\nConflict does affect not only health care but also the economy. Afghanistan is one of the world’s poorest countries, and the perpetuated civil war is the culprit (Wikipedia 2020b) and (Xinhua 2018). Even before COVID-19 strikes, Afghans lived with an average income of less than 2 US dollars a day (Devi 2020). With this poverty level, the government will find it challenging to continue to apply the restriction that has been going on since early March (Cancho and Pradhan 2020). If this happened, there would be a new threat, a hunger (Glinski 2020).\n\n\n\n\n\n\n\n\n\n\nFigure 3: Community mobility index in Afghanistan amid COVID-19\n\n\n\n\nWe can infer from Figure 3 that when the restriction was implemented, there was a decrease in community mobility almost in every place. However, in early July, the mobility to grocery and pharmacy, as well as retails and recreation, has increased again. It is because most of the population works as shopkeepers, street or retail sales, or daily labor in construction, agriculture, or personal services.\nThe poverty as the result of conflict made Afghans have no choice but to survive. That being said, returning to work amid a pandemic will undoubtedly increase the risk of being infected by COVID-19.\nConclusion\n38,815 of COVID-19 cases in Afghanistan up to 15 September 2020 are assumed to be only the iceberg’s tip as this country has a low testing rate.\nThe country’s prolonged conflict has fueled the flames of the pandemic. It resulted in substandard health care and poor communities. The current health care capacity in Afghanistan might not be able to handle many patients amid the pandemic. Meanwhile, poverty leaves Afghanistan with no choice but to make a living, even though it is risky.\nA quote from Bertrand Russel was true that war doesn’t determine who’s right, but who’s left.\nAcknowledgments\nThe website and the blog post was created using R distill package by JJ Allaire, Rich Iannone, and Yihui Xie.\nThe preview photo by Jeff Kingma on Unsplash\nThe translation for Parsi Languange to English of a reference article (Haidar 2020) in this article used Google Translate.\n\n\nCancho, Cesar A., and Tejesh Pradhan. 2020. “Mitigating the Poverty Implications of Covid-19 in Afghanistan.” https://blogs.worldbank.org/endpovertyinsouthasia/mitigating-poverty-implications-covid-19-afghanistan.\n\n\nChangoiwala, Puja. 2020. “Why South Asia’s Covid-19 Numbers Are so Low (for Now).” https://www.quantamagazine.org/why-south-asias-covid-19-numbers-are-so-low-for-now-20200623/.\n\n\nDevi, Sharmila. 2020. “Access to Health Care Under Threat in Afghanistan.” The Lancet (British Edition) 395 (10242): 1962–2.\n\n\nGassen, Joachim. 2020. Tidycovid19: Download, Tidy and Visualize Covid-19 Related Data.\n\n\nGlinski, Stefanie. 2020. “No Profit, No Food: Lockdown in Kabul Prompts Hunger Fears.” https://www.theguardian.com/global-development/2020/apr/01/no-profit-no-food-lockdown-in-kabul-prompts-hunger-fears.\n\n\nGoogle. 2020. “COVID-19 Community Mobility Reports.” https://www.google.com/covid19/mobility/.\n\n\nHaidar, Abdul Wahid. 2020. “Corona Death Toll Higher Than Official Statistics in Kabul.” https://www.etilaatroz.com/101600/corona-death-toll-higher-than-official-stats-kabul/.\n\n\nIannone, Richard, Joe Cheng, and Barret Schloerke. 2020. Gt: Easily Create Presentation-Ready Display Tables. https://CRAN.R-project.org/package=gt.\n\n\nIslamic Republic of Afghanistan Ministry of Finance. 2019. “National Budget Fiscal Year 1399.” https://www.budgetmof.gov.af/images/stories/DGB/BPRD/National%20Budget/1399_Budget/MasterEnglish.pdf.\n\n\nJohn Hopkins University CSSE. 2020. “COVID-19 Dashboard.” https://coronavirus.jhu.edu/map.html.\n\n\nNational Statistics & Information Authority of Afghanistan. 2020. “Afghanistan Statistical Yearbook 2019.” https://www.nsia.gov.af:8080/wp-content/uploads/2020/05/Afghanistan-Statistical-Yearbook-2019-1st-Version.pdf.\n\n\nR Core Team. 2020. R: A Language and Environment for Statistical Computing. Vienna, Austria: R Foundation for Statistical Computing. https://www.R-project.org/.\n\n\nSlowikowski, Kamil. 2020. Ggrepel: Automatically Position Non-Overlapping Text Labels with ’Ggplot2’. https://CRAN.R-project.org/package=ggrepel.\n\n\nUnited Nations Assistance Mission in Afghanistan. 2020. “Afghanistan: 10,000 Civilian Casualties for Six Straight Years.” https://unama.unmissions.org/afghanistan-10000-civilian-casualties-sixth-straight-year.\n\n\nUnited Nations Office for the Coordination of Humanitarian Affairs. 2020. “Afghanistan Weekly Humanitarian Update.” https://reliefweb.int/sites/reliefweb.int/files/resources/afghanistan_humanitarian_weekly_6_september_2020.pdf.\n\n\nWickham, Hadley. 2016. Ggplot2: Elegant Graphics for Data Analysis. Springer-Verlag New York. https://ggplot2.tidyverse.org.\n\n\nWickham, Hadley, Mara Averick, Jennifer Bryan, Winston Chang, Lucy D’Agostino McGowan, Romain François, Garrett Grolemund, et al. 2019. “Welcome to the tidyverse.” Journal of Open Source Software 4 (43): 1686. https://doi.org/10.21105/joss.01686.\n\n\nWickham, Hadley, and Dana Seidel. 2020. Scales: Scale Functions for Visualization. https://CRAN.R-project.org/package=scales.\n\n\nWikipedia. 2020a. “COVID-19 Pandemic in Afghanistan.” https://en.wikipedia.org/wiki/COVID-19_pandemic_in_Afghanistan#February_2020.\n\n\n———. 2020b. “Poverty in Afghanistan.” https://en.wikipedia.org/wiki/Poverty_in_Afghanistan.\n\n\nWorld Bank. 2020. “The World Bank Population Data.” https://data.worldbank.org/indicator/SP.POP.TOTL.\n\n\nWorld Health Organization. 2019. “Estimating Mortality from Covid-19.” https://www.who.int/news-room/commentaries/detail/estimating-mortality-from-covid-19.\n\n\nworldometer. 2020. “COVID-19 Coronavirus Pandemic.” https://www.worldometers.info/coronavirus/?utm_campaign=homeAdvegas1?\n\n\nXinhua. 2018. “Poverty Rising in Afghanistan Amid Prolonged Conflicts, Drought.” http://www.xinhuanet.com/english/2018-10/22/c_137550151_2.htm.\n\n\nYutani, Hiroaki. 2020. Gghighlight: Highlight Lines and Points in ’Ggplot2’. https://CRAN.R-project.org/package=gghighlight.\n\n\n\n\n",
    "preview": "posts/2020-09-15-covid-in-conflict/war.jpg",
    "last_modified": "2020-09-18T16:37:24+07:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-08-31-covid-19-in-indonesia/",
    "title": "The Ugly Truth about Covid-19 Situation in Indonesia",
    "description": "This article aims to do a fact checking of some officials' controversial statements related to Covid-19 situation in Indonesia.",
    "author": [
      {
        "name": "Dewi Lestari Amaliah",
        "url": {}
      }
    ],
    "date": "2020-08-31",
    "categories": [
      "COVID-19",
      "Data Analysis"
    ],
    "contents": "\n\n\nIntroduction\nThe statements from officials, experts, and leaders matter during an ongoing crisis, in this case, is Covid-19. It is because the messages that being told would determine people’s expectation, fear, and reactions to the pandemic (Westman 2020). The problem is that not all the information regarding the crisis is true. The World Health Organization (WHO) even stated that the urgent measure to tackle the “coronavirus infodemic”, the term for Covid-19 misinformation, should be taken immediately (Ghebreyesus and Ng 2020). This infodemic would lead to public confusion about what information and which source to trust (Ali and Kurasawa 2020).\nOne of the examples of the communication problem was shown by the U.S. government. While the U.S. Center for Disease Control and Prevention (CDC) stated that the situation would change quickly and the future is still unknown, President Trump claimed a convincing timeline of vaccine development (Westman 2020).\nIndonesia, the most populous country in South East Asia, also experiences a similar problem. Since the beginning of the emergence of Covid-19 in this country, the officials has made several controversial statements shown Figure 1. One of the reasons why these statements are considered controversial is because as per 28th August 2020, the country is reported has the highest death toll in the region, with 7.169 deaths, more than doubled the second place, Philippines, with 3.325 deaths (Center For Strategic & International Studies 2020). In addition, it is feared that these positive statements will make the public less careful about the virus. Especially now that Indonesia has applied the “New Normal” policy that intended reopening of all the social and economic sectors’ followed with strict hygiene and health protocol (Kusumaningdiyah 2020).\nTherefore, this article aims to do fact checking of these controversial claims using multiple data sources related to Covid-19.\n\n\n\n\n\n+\n-\n\n\n\nFigure 1: The timeline of controversial statement made by the government of Indonesia\n\n\n\n\nData Description\n\n\n\n\n\n\nThis article is utilized the compiled dataset from tidycovid19 R package (Gassen 2020). This package comprises of Covid-19 related data from various source at the country-day level. Initially, there are 207 countries covered in this dataset, but for this article purpose, I used only Indonesia data start from the first case was recorded. Besides, to achieve the aim of this article, I mainly used the confirmed, fatality, and recovered cases data, which are compiled from John Hopkins University Center for System Science and Engineering (JHU CSSE) (John Hopkins University Center for System Science and Engineering 2020); the lockdown measure data from ACAPS (ACAPS 2020); the testing data from Our World in Data (Our World in Data 2020); and the population data from the World Bank (World Bank 2020).\nThat being said, I also provided most of the variables in the compiled data in the package in Table 1. Note that I excluded the region variable (East Asia and Pacific), the income (upper middle income), and the time stamp variable (because it is the same with date variable) from the display.\n\nTable 1. The raw data of Covid-19 in Indonesia\n\n\n\n The definition of each variable can be seen here. \n\n\nTable 1: Variable definition of Covid-19 dataset\n\n\nVariable Name\n\n\nSource\n\n\nDefinition\n\n\niso3c\n\n\nNA\n\n\nISO3c country code as defined by ISO 3166-1 alpha-3\n\n\ncountry\n\n\nNA\n\n\nCountry name\n\n\ndate\n\n\nNA\n\n\nCalendar date\n\n\nconfirmed\n\n\njhu_ccse\n\n\nConfirmed Covid-19 cases as reported by JHU CSSE (accumulated)\n\n\ndeaths\n\n\njhu_ccse\n\n\nCovid-19-related deaths as reported by JHU CSSE (accumulated)\n\n\nrecovered\n\n\njhu_ccse\n\n\nCovid-19 recoveries as reported by JHU CSSE (accumulated)\n\n\necdc_cases\n\n\necdc_covid19\n\n\nCovid-19 cases as reported by ECDC (accumulated)\n\n\necdc_deaths\n\n\necdc_covid19\n\n\nCovid-19-related deaths as reported by ECDC (accumulated)\n\n\ntotal_tests\n\n\nowid_testing\n\n\nAccumulated test counts as reported by Our World in Data\n\n\ntests_units\n\n\nowid_testing\n\n\nDefinition of what constitutes a ‘test’\n\n\nsoc_dist\n\n\nacaps_npi\n\n\nNumber of social distancing measures reported up to date by ACAPS, net of lifted restrictions\n\n\nmov_rest\n\n\nacaps_npi\n\n\nNumber of movement restrictions reported up to date by ACAPS, net of lifted restrictions\n\n\npub_health\n\n\nacaps_npi\n\n\nNumber of public health measures reported up to date by ACAPS, net of lifted restrictions\n\n\ngov_soc_econ\n\n\nacaps_npi\n\n\nNumber of social and economic measures reported up to date by ACAPS, net of lifted restrictions\n\n\nlockdown\n\n\nacaps_npi\n\n\nNumber of lockdown measures reported up to date by ACAPS, net of lifted restrictions\n\n\napple_mtr_driving\n\n\napple_mtr\n\n\nApple Maps usage for driving directions, as percentage*100 relative to the baseline of Jan 13, 2020\n\n\napple_mtr_walking\n\n\napple_mtr\n\n\nApple Maps usage for walking directions, as percentage*100 relative to the baseline of Jan 13, 2020\n\n\napple_mtr_transit\n\n\napple_mtr\n\n\nApple Maps usage for public transit directions, as percentage*100 relative to the baseline of Jan 13, 2020\n\n\ngcmr_retail_recreation\n\n\ngoogle_cmr\n\n\nGoogle Community Mobility Reports data for the frequency that people visit retail and recreation places expressed as a percentage*100 change relative to the baseline period Jan 3 - Feb 6, 2020\n\n\ngcmr_grocery_pharmacy\n\n\ngoogle_cmr\n\n\nGoogle Community Mobility Reports data for the frequency that people visit grocery stores and pharmacies expressed as a percentage*100 change relative to the baseline period Jan 3 - Feb 6, 2020\n\n\ngcmr_parks\n\n\ngoogle_cmr\n\n\nGoogle Community Mobility Reports data for the frequency that people visit parks expressed as a percentage*100 change relative to the baseline period Jan 3 - Feb 6, 2020\n\n\ngcmr_transit_stations\n\n\ngoogle_cmr\n\n\nGoogle Community Mobility Reports data for the frequency that people visit transit stations expressed as a percentage*100 change relative to the baseline period Jan 3 - Feb 6, 2020\n\n\ngcmr_workplaces\n\n\ngoogle_cmr\n\n\nGoogle Community Mobility Reports data for the frequency that people visit workplaces expressed as a percentage*100 change relative to the baseline period Jan 3 - Feb 6, 2020\n\n\ngcmr_residential\n\n\ngoogle_cmr\n\n\nGoogle Community Mobility Reports data for the frequency that people visit residential places expressed as a percentage*100 change relative to the baseline period Jan 3 - Feb 6, 2020\n\n\ngtrends_score\n\n\ngoogle_trends\n\n\nGoogle search volume for the term ‘coronavirus’, relative across time with the country maximum scaled to 100\n\n\ngtrends_country_score\n\n\ngoogle_trends\n\n\nCountry-level Google search volume for the term ‘coronavirus’ over a period starting Jan 1, 2020, relative across countries with the country having the highest search volume scaled to 100 (time-stable)\n\n\nregion\n\n\nwbank\n\n\nCountry region as classified by the World Bank (time-stable)\n\n\nincome\n\n\nwbank\n\n\nCountry income group as classified by the World Bank (time-stable)\n\n\npopulation\n\n\nwbank\n\n\nCountry population as reported by the World Bank (original identifier ‘SP.POP.TOTL’, time-stable)\n\n\nland_area_skm\n\n\nwbank\n\n\nCountry land mass in square kilometers as reported by the World Bank (original identifier ‘AG.LND.TOTL.K2’, time-stable)\n\n\npop_density\n\n\nwbank\n\n\nCountry population density as reported by the World Bank (original identifier ‘EN.POP.DNST’, time-stable)\n\n\npop_largest_city\n\n\nwbank\n\n\nPopulation in the largest metropolian area of the country as reported by the World Bank (original identifier ‘EN.URB.LCTY’, time-stable)\n\n\nlife_expectancy\n\n\nwbank\n\n\nAverage life expectancy at birth of country citizens in years as reported by the World Bank (original identifier ‘SP.DYN.LE00.IN’, time-stable)\n\n\ngdp_capita\n\n\nwbank\n\n\nCountry gross domestic product per capita, measured in 2010 US-$ as reported by the World Bank (original identifier ‘NY.GDP.PCAP.KD’, time-stable)\n\n\ntimestamp\n\n\nNA\n\n\nDate and time where data has been collected from authoritative sources\n\n\nAnalysis and Findings\nThe analysis is performed mainly using the functions in tidyverse (Wickham et al. 2019) package in R (R Core Team 2020). I also used DT (Xie, Cheng, and Tan 2020), kableExtra (Zhu 2019), timevis (Attali and Almende B.V. 2019), plotly (Sievert 2020), gridExtra (Auguie 2017), and formattable (Ren and Russell 2016) packages. Since tidycovid19 only provides cumulative cases, death, recovered, and tests, I wrangled the dataset to obtain the daily number. I also mutated new variables, namely infection rate, positive rate, and testing rate. The definition of those variables is as follows:\nInfection rate: According to Health Centric Advisors Health Centric Advisors (2017), there are three ways of calculating the infection rate. The formula I used here is the number of infected people divided by the total population multiplied by the constant variable, which is 1,000,000 people, this figure is calculated in a daily level.\nPositive rate: It is the fraction of tests that have a positive result. The calculation is the number of cumulative confirmed cases divided by the total tests (percentage) (Jr. 2020).\nTesting Rate : The number of test per 1,000,000 population at daily level.\n\nLimitation\nSince the results of the Covid-19 test in Indonesia were not released on the same day, there should be a lag between the number of cases and the number of tests used to calculate the positive rate. However, the length of lag between the test time and the results varies between test locations, making it difficult to determine the right lag. Therefore, in the calculation, the positive rate is based on the cumulative number.\nFor the lockdown variable in the dataset, that I previously wanted to use, it apparently did not match with the date of “New Normal” policy began in Indonesia. Thus, I ended up not using this data.\n\n\n\nIn addition, I would not check all of the statements in Figure 1. I would only check the statements that could be answered using this dataset one by one.\n\n\nStatement 1: Covid-19 spread has gone down, so the “New Normal” scheme could be applied.\n\nThis claim was stated by the Coordinating Minister for Maritime Affairs and Investment, Luhut Binsar Pandjaitan, on June, 2nd 2020. He claimed that the decision to reopen the economy and ease the mobility restriction, which is called the “New Normal”, is based on data that the spread of the virus has declined and the number of new cases has gone down to 600 cases per day on average (Afriyadi 2020).\nThe Fact\nThere are two main points that I would check in this statement. First, is the declining of the average of new cases per day and the second is the declining of the virus spread.\n\n\n\nThe number of daily case shown in Figure 2 suggests that it was true that the number of cases as of June, 2 2020 was 609, as claimed. Previous days, the number of cases was also in the range of 600s. However, we could not really say that the cases was declining as until this statement was made, June 2 2020, the trend was positive.\nRegarding the spreading of the virus, the Minister did not say its definition. Thus, I would assume that it is the infection rate, since the spread is supposed to be regarding the number of people who are likely to get infected by the virus. The infection rate shown in Figure 2 suggests that the spread of the virus was not declining. It was true that the infection rate had decreased at the end of May, compared to the third week of May, but again, the trend line shows that the spread of the virus was still increasing.\nThe government, should have seen the bigger picture, instead of the spike shown in only a short time period. Hence, we could argue that this claim is busted.\n\n\n\n\n\n\n\n\nFigure 2: Daily confirmed cases and infection rate of Covid-19 in Indonesia from 2020-03-2 until 2020-06-02\n\n\n\n\n\n\n\nDespite this positive trend, Indonesian government has applied the “New Normal” scheme started from 5th June 2020 (Widodo 2020). Therefore, I was curious about how the statistics changed after this scheme put in. I used median value as the summary statistics because the distribution of the indicators, which are the daily cases, daily fatality, daily recovered, daily testing, infection rate, testing rate, and positive rate are mostly skewed, especially before “New Normal” phase. According The Australian Bureau of Statistics (ABS) (Australian Bureau of Statistics 2013), the median is more robust to skewed data and is sometimes the favorable measure of central tendency when the distribution is asymmetric.\n Expand here to see the distribution.\n\n\n\n\n\n\n\nTable 2. Covid-19 indicators before and after “New Normal” policy in Indonesia\n\n\n\nIndicator\n\n\nBefore New Normal\n\n\nAfter New Normal\n\n\nMedian of daily confirmed cases \n\n\n297.000\n\n\n  1693 \n\n\nMedian of daily fatality \n\n\n15.000\n\n\n  66 \n\n\nMedian of daily recovered \n\n\n46.000\n\n\n  1474 \n\n\nMedian of daily people tested \n\n\n3092.000\n\n\n  12168.5 \n\n\nMedian of daily infection rate \n\n\n1.097\n\n\n  6.256 \n\n\nMedian of daily testing rate \n\n\n11.425\n\n\n  44.964 \n\n\nMedian of cumulative positive rate\n\n\n14.415\n\n\n  12.279 \n\n\nAll indicators in Table 2. show an increase after the “New Normal” policy was implemented. If we look at the number of confirmed cases and the infection rate, we will conclude that after the “New Normal”, there has been a drastic increase in Covid-19 cases in Indonesia by about five times. Likewise with the death toll and recovery cases, the number was increasing because the number of cases was increasing.\nIn fact, this does not necessarily explain the true condition because the number of cases is greatly influenced by the number of people tested. If we look at the number of people tested, there was an increase after the “New Normal” period, even though the rate is only 43 people per 1,000,000 population per day. Hence, increasing cases makes sense.\nFurthermore, if we look at a positive rate, we can see that looking at the number of positive cases only is not enough. In fact, there was a decrease in positive rates after the “New Normal”. However, bear in mind that the positive rate here is cumulative figure. In addition, speaking of positive rate and “New Normal”, the WHO recommended that the positive rate from a comprehensive testing program should be at or below 5 percent for at least 14 days to ease the restriction and resume the economic and social activity (Jr. 2020). How about Indonesia? Figure 3 shows the answer that Indonesia did not follow the WHO reccommendation because the positive rate was still above 10 percent when the “New Normal” began.\n\n\nStatement 2: The COVID-19 positive rate has gone down and recovery rate has improved greatly to almost 66%\n\nThis contend was stated also by the Coordinating Minister for Maritime Affairs and Investment on August, 14th 2020 (Rosana 2020). Luhut Claimed that the handling of Covid-19, shown by the declining positive rate, has improved. Moreover, the recovery rate is nearly 66 percent.\nThe Fact\n\n\n\nFigure 3 shows that the positive rate has decreased when compared to the start of the pandemic in the country. However, in this figure, we can see that there is a slight inverted curve which indicates that the positive rate is increasing again.\nRegarding 66 percent recovery claims, I tried to divide the recovered cases by the confirmed cases on that date and got a result of 66.32 percent. This means that the claim is true.\nBut wait, is this good news? According to the health experts, using the recovery rate as an indicator to assess the performance of handling Covid-19 is not ideal. This is because first, the recovery rate is calculated by dividing the number of discharged patients with total Covid-19 patients. However, those who are hospitalized can either recover or die, so they cannot be included in the calculation (Devulapalli 2020). Secondly, 99% of people infected with COVID recovers, so the number of recovery rate is not really useful (Warrier 2020).\n\n\n\n\nFigure 3: The positivity rate of Covid-19 in Indonesia\n\n\n\n\n\n\nStatement 3: There will not be a second wave of COVID-19 outbreak in Indonesia\n\nThe Coordinating Minister for Maritime Affairs and Investment did seem to like to preach “good news”. On 13 August 2020, he claimed that Indonesia would not experience the second wave of Covid-19 (Thomas 2020).\nThe Fact\nThe fact of this claim is pretty straight forward. It is true. According to Dr.Anthony Fauci, the director of the U.S. National Institute of Allergy and Infectious Diseases, the second wave happens if the number of confirmed cases goes up and then comes back down to reach low single digits (Stieg 2020). The example of this case is New Zealand, who had 24 days streak of zeros case before getting the new cases again. Hence, how could Indonesia experience the second wave, if the first wave has not yet reached its peak?\n\n\n\n\n\nFigure 4: The number of confirmed cases daily in Indonesia\n\n\n\n\n\n\nStatement 4: COVID-19 in Indonesia is now under control\n\nNow, you could guess who made the statement. Yes, it is correct. This statement was, again, told by the Minister for Maritime Affairs and Investment on 19 August 2020.\nThe Fact\n\n\n\nThe fact is this claim is might be incorrect, at least according to the WHO criteria. According to the WHO in May, one of the indicator that the epidemic is under control is that the positive rate is less than 5 percent (Our World in Data 2020). As per date of this statement, the positive rate in Indonesia is 13.22 percent.\nConclusion\nThree out of four of Luhut’s claims, which were checked with data from various sources, were correct, in numerical terms. However, if we look at the bigger picture and the context, these claims were actually busted. For example, if the trend is seen in its entirety since the beginning of the pandemic, the cases and the spread of Covid-19 in Indonesia could not be said as declined. Besides, contextually, the usage of recovered cases as an indicator to claim the success of Covid-19 handling could not be justified.\nThe ugly truth about the Covid-19 situation in Indonesia is that the cases are still increasing, the testing rates per 1,000,000 population are still small, and the positive rate is still above 5 percent. However, the uglier truth is that the “false positive claims” have been made by the person who should have known better.\n\n\nACAPS. 2020. “#COVID-19 Government Measures Dataset.” https://www.acaps.org/covid19-government-measures-dataset.\n\n\nAfriyadi, Achmad Dwi. 2020. “Luhut Klaim Kasus Baru Corona Turun: Rata-Rata 600/Hari (Luhut Claims That the New Cases Has Declined: 600 Cases Daily on Average).” https://finance.detik.com/berita-ekonomi-bisnis/d-5038016/luhut-klaim-kasus-baru-corona-turun-rata-rata-600hari.\n\n\nAli, S. Harris, and Fuyuki Kurasawa. 2020. “#COVID19: Social Media Both a Blessing and a Curse During Coronavirus Pandemic.” https://theconversation.com/covid19-social-media-both-a-blessing-and-a-curse-during-coronavirus-pandemic-133596.\n\n\nAttali, Dean, and Almende B.V. 2019. Timevis: Create Interactive Timeline Visualizations in R. https://CRAN.R-project.org/package=timevis.\n\n\nAuguie, Baptiste. 2017. GridExtra: Miscellaneous Functions for \"Grid\" Graphics. https://CRAN.R-project.org/package=gridExtra.\n\n\nAustralian Bureau of Statistics. 2013. “Measures of Central Tendency.” https://www.abs.gov.au/websitedbs/a3121120.nsf/home/statistical+language+-+measures+of+central+tendency.\n\n\nCenter For Strategic & International Studies. 2020. “Southeast Asia Covid-19 Tracker.” https://www.csis.org/programs/southeast-asia-program/southeast-asia-covid-19-tracker-0.\n\n\nDevulapalli, Rahul. 2020. “Recovery Rate: An Incorrect Indicator to Asses Covid-19 Impact.” https://www.theweek.in/news/india/2020/07/17/recovery-rate-an-incorrect-indicator-to-assess-covid-19-impact.html.\n\n\nGassen, Joachim. 2020. Tidycovid19: Download, Tidy and Visualize Covid-19 Related Data.\n\n\nGhebreyesus, Tedros Adhanom, and Alex Ng. 2020. “Coronavirus: How the Who Is Leading the Social Media Fight Against Misinformation.” https://www.scmp.com/comment/opinion/article/3050080/coronavirus-how-who-leading-social-media-fight-against.\n\n\nHealth Centric Advisors. 2017. “Calculation of Infection Rates.” https://healthcentricadvisors.org/wp-content/uploads/2017/03/Cal_Inf_Rates.pdf.\n\n\nJohn Hopkins University Center for System Science and Engineering. 2020. “COVID-19 Dashboard.” https://coronavirus.jhu.edu/map.html.\n\n\nJr., Ronald D. Fricker. 2020. “Test Positivity Rate: How This One Figure Explains That the Us Isn’t Doing Enough Testing yet.” https://theconversation.com/test-positivity-rate-how-this-one-figure-explains-that-the-us-isnt-doing-enough-testing-yet-143340.\n\n\nKusumaningdiyah, Hapsari. 2020. “New Normal: Why People Act as If the Pandemic Is over.” https://www.thejakartapost.com/academia/2020/06/30/new-normal-why-people-act-as-if-the-pandemic-is-over.html.\n\n\nOur World in Data. 2020. “Coronavirus (Covid-19) Testing.” https://ourworldindata.org/coronavirus-testing.\n\n\nR Core Team. 2020. R: A Language and Environment for Statistical Computing. Vienna, Austria: R Foundation for Statistical Computing. https://www.R-project.org/.\n\n\nRen, Kun, and Kenton Russell. 2016. Formattable: Create ’Formattable’ Data Structures. https://CRAN.R-project.org/package=formattable.\n\n\nRosana, Francisca Christy. 2020. “Luhut Klaim Penanganan Covid-19 Membaik, Tingkat Kesembuhan Hampir 66 Persen(Luhut Claims Handling of Covid-19 Improved, Recovery Rate Nearly 66 Percent).” https://bisnis.tempo.co/read/1375779/luhut-klaim-penanganan-covid-19-membaik-tingkat-kesembuhan-hampir-66-persen/full&view=ok.\n\n\nSievert, Carson. 2020. Interactive Web-Based Data Visualization with R, Plotly, and Shiny. Chapman; Hall/CRC. https://plotly-r.com.\n\n\nStieg, Cory. 2020. “What a Second Wave of Covid-19 Could Look Like and How to Prevent It.” https://www.cnbc.com/2020/06/28/what-second-wave-of-covid-19-means-and-how-to-prevent-it.html.\n\n\nThomas, Vincent Fabian. 2020. “Menko Luhut Klaim Ri Tak Akan Alami Gelombang Ii Covid-19 (the Coordinating Minister Claimed That Indonesia Will Not Experience Covid-19).” https://tirto.id/menko-luhut-klaim-ri-tak-akan-alami-gelombang-ii-covid-19-fXCM.\n\n\nWarrier, Varun. 2020. “Experts Say Number of New Covid 19 Cases Is the Only Right Indicator for Now.” https://www.timesnownews.com/india/article/experts-say-number-of-new-covid-cases-is-the-only-right-indicator-for-now/607500.\n\n\nWestman, Nicole. 2020. “Effective Communication Is Critical During Emergencies Like the Covid-19 Outbreak.” https://www.theverge.com/2020/3/4/21164563/coronavirus-risk-communication-cdc-trump-trust.\n\n\nWickham, Hadley, Mara Averick, Jennifer Bryan, Winston Chang, Lucy D’Agostino McGowan, Romain François, Garrett Grolemund, et al. 2019. “Welcome to the tidyverse.” Journal of Open Source Software 4 (43): 1686. https://doi.org/10.21105/joss.01686.\n\n\nWidodo, Nicky Aulia. 2020. “’New Normal’: Jakarta Set to Ease Virus Restrictions.” https://www.aa.com.tr/en/asia-pacific/new-normal-jakarta-set-to-ease-virus-restrictions/1864990.\n\n\nWorld Bank. 2020. “The World Bank Population Data.” https://data.worldbank.org/indicator/SP.POP.TOTL.\n\n\nXie, Yihui, Joe Cheng, and Xianying Tan. 2020. DT: A Wrapper of the Javascript Library ’Datatables’. https://CRAN.R-project.org/package=DT.\n\n\nZhu, Hao. 2019. KableExtra: Construct Complex Table with ’Kable’ and Pipe Syntax. https://CRAN.R-project.org/package=kableExtra.\n\n\n\n\n",
    "preview": "posts/2020-08-31-covid-19-in-indonesia/maskandcovid.JPG",
    "last_modified": "2020-09-15T20:48:43+07:00",
    "input_file": {}
  }
]
